
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 2 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.local_redis_password[0]
  * module.local_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * module.em-icp-redis-cache[0].azurerm_private_endpoint.this[0]
  * module.em-icp-redis-cache[0].azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.local_redis_password[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "local_redis_password" {
        id                      = "https://em-icp-aat.vault.azure.net/secrets/redis-password/ef13d02b7498461cab5a0d513496f281"
        name                    = "redis-password"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.em-icp-redis-cache[0].azurerm_private_endpoint.this[0] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-icp-redis-cache-cache-aat/providers/Microsoft.Network/privateEndpoints/em-icp-redis-cache-aat" -> (known after apply)
        name                     = "em-icp-redis-cache-aat"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-icp-redis-cache-cache-aat/providers/Microsoft.Network/networkInterfaces/em-icp-redis-cache-aat.nic.bae7b02c-471f-41a4-a29d-1eb41508ada0"
              - name = "em-icp-redis-cache-aat.nic.bae7b02c-471f-41a4-a29d-1eb41508ada0"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-icp-redis-cache-cache-aat/providers/Microsoft.Network/privateEndpoints/em-icp-redis-cache-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.redis.cache.windows.net"
              - name                = "privatelink.redis.cache.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "em-icp-redis-cache-aat.privatelink.redis.cache.windows.net"
                      - ip_addresses = [
                          - "10.96.136.19",
                        ]
                      - name         = "em-icp-redis-cache-aat"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ tags                     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/em-icp-api.git" -> null
            "application"         = "evidence-management"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/em-icp-api.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#em-dev-chat"
            "environment"         = "staging"
            "managedBy"           = "Evidence Management"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-icp-redis-cache-cache-aat/providers/Microsoft.Network/privateEndpoints/em-icp-redis-cache-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup" -> (known after apply)
            name                 = "redis-endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "em-icp-redis-cache-aat"
          ~ private_connection_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-icp-redis-cache-cache-aat/providers/Microsoft.Cache/redis/em-icp-redis-cache-aat" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.96.136.19" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.em-icp-redis-cache[0].azurerm_redis_cache.redis must be replaced
-/+ resource "azurerm_redis_cache" "redis" {
      ~ family                        = "P" -> "C"
      ~ hostname                      = "em-icp-redis-cache-aat.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-icp-redis-cache-cache-aat/providers/Microsoft.Cache/redis/em-icp-redis-cache-aat" -> (known after apply)
        name                          = "em-icp-redis-cache-aat"
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      ~ redis_version                 = "6.0" -> "6"
      ~ replicas_per_master           = 0 -> (known after apply)
      ~ replicas_per_primary          = 0 -> (known after apply)
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      ~ sku_name                      = "Premium" -> "Basic" # forces replacement
      ~ ssl_port                      = 6380 -> (known after apply)
        tags                          = {
            "application"         = "evidence-management"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/em-icp-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#em-dev-chat"
            "environment"         = "staging"
            "managedBy"           = "Evidence Management"
        }
      - tenant_settings               = {} -> null
      - zones                         = [] -> null
        # (6 unchanged attributes hidden)

      ~ redis_configuration {
          - aof_backup_enabled              = false -> null
          ~ maxclients                      = 7500 -> (known after apply)
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
            # (5 unchanged attributes hidden)
        }
    }

  # module.local_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-icp-aat/providers/Microsoft.KeyVault/vaults/em-icp-aat|em-icp-aat"
        name                           = "em-icp-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":855,"Program":"tfcmt","SHA1":"","Vars":{}} -->